locust-taurus/load_tests.yml
execution:
- executor: locust
  concurrency: 10
  ramp-up: 30s
  iterations: 1000
  hold-for: 1m30s
  scenario: locust-example

scenarios:
  locust-example:
    default-address: http://localhost:3000
    script: ../scenarios/taurus_tests.py

reporting:
- module: console
- module: final-stats
  summary: true  # overall samples count and percent of failures
  percentiles: true  # display average times and percentiles
  summary-labels: true # provides list of sample labels, status, percentage of completed, avg time and errors
  failed-labels: true  # provides list of sample labels with failures
  test-duration: true  # provides test duration
  dump-xml: locust-report.xml
  dump-csv: locust-report.csv
- module: junit-xml
  filename: ./junit-report.xml
  data-source: pass-fail
- module: blazemeter
  # https://gettaurus.org/docs/BlazemeterReporter/
  report-name: My Jenkins Build
  test: Taurus Demo
  project: Taurus Tests Group