locust-taurus/locust2.yml
execution:
- executor: locust
  concurrency:
    local: 10
    cloud: 10
  locations:
    us-east-1: 1
  locations-weighted: true
  ramp-up: 1m
  iterations: 1000
  hold-for: 400m
  scenario: locust-example

scenarios:
  locust-example:
    default-address: https://jsonplaceholder.typicode.com
    script: taurus_test.py

modules:
  cloud:
    account: ######
    workspace: Default workspace
    project: Default project
    token: ########################
    timeout: 5
    browser-open: start
    test: LOCUST_DEMO